In [1]:
# calc_multi関数を定義
def calc_multi(a,b):
    return a * b

calc_multi(3,10)

30

In [2]:
(lambda a,b:a * b)(3,10)

30

In [3]:
sample_str = "Data Science"

In [6]:
for i in range(0,len(sample_str)):
    print(sample_str[i])

D
a
t
a

S
c
i
e
n
c
e

In [7]:
print(sum(range(0,51)))

1275

In [8]:
class PrintClass:
    def print_me(self):
        print(self.x,self.y)
        
p1 = PrintClass()

p1.x = 10
p1.y = 100
p1.z = 1000

p1.print_me()

10 100

In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series,DataFrame

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

%precision 3

'%.3f'

In [2]:
data = np.array([9,2,3,4,10,6,7,8,1,5])
data

array([ 9,  2,  3,  4, 10,  6,  7,  8,  1,  5])

In [3]:
data.dtype

dtype('int32')

In [4]:
print('次元数',data.ndim)
print('要素数',data.size)

次元数 1
要素数 10

In [5]:
data1 = data * 2
print(data1)

[18  4  6  8 20 12 14 16  2 10]

In [6]:
print(data)
data.sort()

print(data)

[ 9  2  3  4 10  6  7  8  1  5]
[ 1  2  3  4  5  6  7  8  9 10]

In [7]:
data

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [8]:
print('Min:',data.min())
print('Max:',data.max())

Min: 1
Max: 10

In [9]:
print('Sum:',data.sum())
print('Cum:',data.cumsum())
print('Ratio:',data.cumsum()/data.sum())

Sum: 55
Cum: [ 1  3  6 10 15 21 28 36 45 55]
Ratio: [0.018 0.055 0.109 0.182 0.273 0.382 0.509 0.655 0.818 1.   ]

In [10]:
random.seed(0)

# 正規分布（平均０、分散１）の乱数を１０個生成
rnd_data = random.randn(10)

print('乱数10個の配列:',rnd_data)

乱数10個の配列: [ 1.764  0.4    0.979  2.241  1.868 -0.977  0.95  -0.151 -0.103  0.411]

In [11]:
data = np.array([9,2,3,4,10,6,7,8,1,5])

# ランダム抽出
# 10個を抽出
print(random.choice(data,10))

# 10個を抽出（重複無し、非復元抽出）
print(random.choice(data,10,replace=False))

[ 7  8  8  1  2  6  5  1  5 10]
[10  2  7  8  3  1  6  5  9  4]

In [12]:
np.arange(9)

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [13]:
array1 = np.arange(9).reshape(3,3)
print(array1)

[[0 1 2]
 [3 4 5]
 [6 7 8]]

In [14]:
array1[0]

array([0, 1, 2])

In [15]:
array1[0][1]

1

In [16]:
array1[1][1]

4

In [17]:
data = np.arange(51)
tmp = data.sum()

In [18]:
print(tmp)

1275

In [19]:
rnd_data = random.randn(10)
print(rnd_data)

[ 1.494 -0.205  0.313 -0.854 -2.553  0.654  0.864 -0.742  2.27  -1.454]

In [20]:
min_rnd_data = rnd_data.min()

In [21]:
print(min_rnd_data)

-2.5529898158340787

In [22]:
max_rnd_data = rnd_data.max()
print(max_rnd_data)

2.2697546239876076

In [23]:
tmp = rnd_data.sum()
print(tmp)

-0.21381832081082974

In [24]:
a = np.ones((5,5)) * 3
print(a)

[[3. 3. 3. 3. 3.]
 [3. 3. 3. 3. 3.]
 [3. 3. 3. 3. 3.]
 [3. 3. 3. 3. 3.]
 [3. 3. 3. 3. 3.]]

In [25]:
print(a ** 2)

[[9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9.]]

In [26]:
import scipy.linalg as linalg
from scipy.optimize import minimize_scalar

In [28]:
matrix = np.array([[1,-1,-1],[-1,1,-1],[-1,-1,1]])

print('行列式')
print(linalg.det(matrix))

行列式
-4.0

In [29]:
print("逆行列")
print(linalg.inv(matrix))

逆行列
[[ 0.  -0.5 -0.5]
 [-0.5 -0.  -0.5]
 [-0.5 -0.5  0. ]]

In [30]:
print(matrix.dot(linalg.inv(matrix)))

[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

In [31]:
eig_value,eig_vector = linalg.eig(matrix)

print('固有値')
print(eig_value)

print('固有ベクトル')
print(eig_vector)

固有値
[-1.+0.j  2.+0.j  2.+0.j]
固有ベクトル
[[ 0.577 -0.816  0.428]
 [ 0.577  0.408 -0.816]
 [ 0.577  0.408  0.389]]

In [32]:
A = np.array([[1,2,3],[1,3,2],[3,1,2]])

In [33]:
print(A)

[[1 2 3]
 [1 3 2]
 [3 1 2]]

In [34]:
print('行列式')
print(linalg.det(A))

行列式
-12.000000000000002

In [35]:
print('逆行列')
print(linalg.inv(A))

逆行列
[[-0.333  0.083  0.417]
 [-0.333  0.583 -0.083]
 [ 0.667 -0.417 -0.083]]

In [36]:
print(A.dot(linalg.inv(A)))

[[ 1.00e+00 -2.22e-16  0.00e+00]
 [ 0.00e+00  1.00e+00  0.00e+00]
 [ 2.22e-16 -2.22e-16  1.00e+00]]

In [37]:
eig_value,eig_vector = linalg.eig(A)

print('固有値')

固有値

In [38]:
print(eig_value)

[ 6.   +0.j -1.414+0.j  1.414+0.j]

In [39]:
print('固有ベクトル')
print(eig_vector)

固有ベクトル
[[-0.577 -0.722  0.16 ]
 [-0.577 -0.143 -0.811]
 [-0.577  0.677  0.563]]

In [40]:
from pandas import Series,DataFrame

In [41]:
# Series
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])

In [42]:
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [43]:
#indexをアルファベットでつける
sample_pandas_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90],index=['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [44]:
tmp = pd.Series([1,2,3,4,5],index=['a','b','c'])
# indexが要素数足りないとエラーになる

ValueError: Length of passed values is 5, index implies 3.

In [45]:
print('データの値：',sample_pandas_index_data.values)
print('インデックスの値:',sample_pandas_index_data.index)

データの値： [ 0 10 20 30 40 50 60 70 80 90]
インデックスの値: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [46]:
attri_data1 = {'ID':['100','101','102','103','104'],
              'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
              'Birth_year':[1990,1989,1992,1997,1982],
              'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [48]:
attri_data_frame1
#jupyter環境だとSeriresオブジェクトやDataFrameオブジェクトを認識してきれいに表示してくれる

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [49]:
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [50]:
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [51]:
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [52]:
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [53]:
attri_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [54]:
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

In [55]:
attri_data_frame1[attri_data_frame1['Birth_year'] < 1990]

    ID   City  Birth_year   Name
1  101  Osaka        1989  Akiko
4  104  Tokyo        1982  Steve

In [58]:
# axis=0=>行、axis=1=>列を指定する
attri_data_frame1.drop(['Birth_year'],axis=1)
# 元データからBirth_year列を削除するわけではない

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [57]:
print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [59]:
attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [60]:
pd.merge(attri_data_frame1,attri_data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

In [61]:
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [62]:
print(attri_data_frame2.groupby('Sex')['English'].max())
print(attri_data_frame2.groupby('Sex')['English'].min())

Sex
F    30
M    90
Name: English, dtype: int64
Sex
F    20
M    30
Name: English, dtype: int64

In [63]:
attri_data1 = {'ID':['1','2','3','4','5'],
               'Sex':['F','F','M','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Saito','Horie','Kondo','Kawada','Matsubara']}
attri_data_frame1 = DataFrame(attri_data1)

In [64]:
attri_data_frame1

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
3  4   M    300     Kawada
4  5   F    700  Matsubara

In [65]:
print('Money>=500:',attri_data_frame1[attri_data_frame1['Money'] >= 500])

Money>=500:   ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matsubara

In [66]:
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [67]:
attri_data2 = {'ID':['3','4','7'],
               'Math':[60,30,40],
               'English':[80,20,40]}
attri_data_frame2 = DataFrame(attri_data2)

In [68]:
attri_data_frame2

  ID  Math  English
0  3    60       80
1  4    30       20
2  7    40       40

In [70]:
tmp = pd.merge(attri_data_frame1,attri_data_frame2)

In [71]:
tmp

  ID Sex  Money    Name  Math  English
0  3   M    500   Kondo    60       80
1  4   M    300  Kawada    30       20

In [72]:
tmp['Math'].mean()

45.000

In [73]:
tmp['English'].mean()

50.000

In [74]:
import matplotlib as mpl
import seaborn as sns

import matplotlib.pyplot as plt

%matplotlib inline